/**
  *********************************************************************
  * @file    MainTask.c
  * @author  fire
  * @version V1.0
  * @date    2019-xx-xx
  * @brief   FreeRTOS v9.0.0 + STM32 工程模版
  *********************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 F429 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */
/*******************************************************************************
 * 包含的头文件
 ******************************************************************************/
#include "MainTask.h"


/*******************************************************************************
 * 全局变量
 ******************************************************************************/
extern GUI_CONST_STORAGE GUI_BITMAP bmwildfire;

/*******************************************************************************
 * 函数
 ******************************************************************************/
/**
  * @brief GUI主任务
  * @note 无
  * @param 无
  * @retval 无
  */
void MainTask(void)
{
	/* 设置背景色 */
	GUI_SetBkColor(GUI_WHITE);
	GUI_Clear();
	
	while(1)
	{
    /* 显示位图 */
    GUI_DrawBitmap(&bmwildfire,             /* 位图数据 */
                   (LCD_GetXSize() - 356)/2,/* 左上角的x坐标 */
                   (LCD_GetYSize() - 95)/2);/* 左上角的y坐标 */
    GUI_Delay(2000);
    GUI_Clear();
    
    /* 显示放大后的位图 */
    GUI_DrawBitmapMag(&bmwildfire,/* 位图数据 */
                      44,         /* 左上角的x坐标 */
                      145,        /* 左上角的y坐标 */
                      2,          /* x方向的放大倍数 */
                      2);         /* y方向的放大倍数 */
    GUI_Delay(2000);
    GUI_Clear();
	}
}
